19Lukas/GC9A01_STM32F103/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DISPLAY_RST_Pin GPIO_PIN_3
#define DISPLAY_RST_GPIO_Port GPIOA
#define DISPLAY_CS_Pin GPIO_PIN_4
#define DISPLAY_CS_GPIO_Port GPIOA
#define DISPLAY_SCK_Pin GPIO_PIN_5
#define DISPLAY_SCK_GPIO_Port GPIOA
#define DISPLAY_DC_Pin GPIO_PIN_6
#define DISPLAY_DC_GPIO_Port GPIOA
#define DISPLAY_MOSI_Pin GPIO_PIN_7
#define DISPLAY_MOSI_GPIO_Port GPIOA
#define OLED_SCL_Pin GPIO_PIN_10
#define OLED_SCL_GPIO_Port GPIOB
#define OLED_SDA_Pin GPIO_PIN_11
#define OLED_SDA_GPIO_Port GPIOB
#define NRF2_CS_Pin GPIO_PIN_12
#define NRF2_CS_GPIO_Port GPIOB
#define NRF2_SCK_Pin GPIO_PIN_13
#define NRF2_SCK_GPIO_Port GPIOB
#define NRF2_MISO_Pin GPIO_PIN_14
#define NRF2_MISO_GPIO_Port GPIOB
#define NRF2_MOSI_Pin GPIO_PIN_15
#define NRF2_MOSI_GPIO_Port GPIOB
#define NRF2_CE_Pin GPIO_PIN_8
#define NRF2_CE_GPIO_Port GPIOA
#define NRF2_IRQ_Pin GPIO_PIN_9
#define NRF2_IRQ_GPIO_Port GPIOA
#define NRF2_IRQ_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
